/*
Õæ±ùºÓ(Yanyan)µÄ¹¤×÷ÊÒ¡£
*/
#include <ansi.h>
inherit ROOM;
string show_paper();
string show_self();
void create()
{
	set("short",HIC"Õæ±ùºÓµÄ¼Ò"NOR);
        set("long", @LONG[1;36m
            .-"''-.  _
          .'       `( \
        @/            ')   ,--,__,-"
        /        /      \ /     /   _/
      __|           ,   |/         /
    .~  `\   / \ ,  |   /
  .~      `\    `  /  _/   _/
.~          `\  ~~`__/    /
~             `--'/
             /   /    /     Õæ»³ÄîÄÇÎÞÓÇÎÞÂÇµÄÈÕ×Ó¡­¡­
            /  /'    /[2;37;0m
ÅÔ±ßµÄ×À×ÓÉÏ»¹ÓÐÒ»¸öÅÌ×Ó (pan)£¬Ç½ÉÏÌù×ÅÒ»ÕÅÖ½ (paper)£¬
µØÉÏ»¹·Å×ÅÒ»¸ö´óÒôÏì(yinxiang)£¬´²Í·»¹°Ú×ÅÒ»¸ö¾µ×Ó(jing)¡£
LONG
);
        set("item_desc",([
        "bei":HIW"º®±ù¾Ó\n\n"NOR,
        ]));
        set("objects",([
          __DIR__"box":1,
          ]));
        set("exits",([
	"out" : "/d/wiz/wizroom2",
        ]));
        set("no_quit",1);
        set("no_death",1);
        set("item_desc",([
        "pan":"
         _..,----,.._
      .-;'-.,____,.-';
     (( |            |
      `))            ;   ÒªÅ£ÄÌ¡¢¿§·È¡¢»¹ÊÇ²è¡­¡­
       ` |          | 
      .-' `,.____.,' '-.
     (     '------'     )
      `-=..________..--'
      \n",
      "paper":(:show_paper:),
       "yinxiang":"
  ¬Ä¬Ä  ¡ñ        ¡ñ£©      ¡ñ       ¡ñ £©     £Ü¡ñ£¯    £Ü¡ñ
¬Ä¬Ä¬Ä£¼©§£¾   £¨©§       £¨©§£©   £¨£©         ©§©§      £¨ £¾ 
¬Ä¬Ä¬Ä £¯£Ü    £¯ £©      £¨£Ü    £¯ £©        £¯ £Ü       £¯£Ü\n"+
BLINK+"¬Ä¬Ä=×óÈýÈ¦£¬ÓÒÈýÈ¦£¬²±×ÓÅ¤Å¤£¬Æ¨¹ÉÅ¤Å¤£¬Äã¾Í²»»áÀÏ= 
        \n"NOR,
       "jing":(:show_self:),
      ]));
      
        setup();
}

int valid_leave(object ob,string dir)
{
  if(!wizardp(ob))
   return notify_fail("µ½ÁËÖ÷ÈË¼Ò»¹ÊÇ²»ÒªËæ´¦×ß¶¯µÄºÃ¡£\n");
  return ::valid_leave(ob,dir);
}

string show_paper()
{
  write(@LONG
   ¡¡¡¡¡¡¡¡¡¡ _/¡¡ \_
 ¡¡¡¡¡¡¡¡ _/¡¡¡¡¡¡/\_
 ¡¡¡¡¡¡ _/¡¡¡¡¡¡ / / \_
 ¡¡¡¡ _/¡¡¡¡¡¡¡¡/ /¡¡¡¡\_
 ¡¡¡¡/  __ ____/ /¡¡¡¡¡¡ \
 ¡¡ | (__ ____/_/_()~~~~~|
 ¡¡¡¡\_¡¡¡¡¡¡/ /¡¡¡¡¡¡¡¡_/
 ¡¡¡¡¡¡\_¡¡ / /²»×¼³ÔÑÌ_/
 ¡¡¡¡¡¡¡¡\_/ /¡¡ OK! _/
 ¡¡¡¡¡¡¡¡¡¡\/¡¡¡¡  _/
LONG);
return "\n";
}
string show_self()
{
  write(@LONG
    @@@@@
   @@. .@@
  @@@\=/@@@
  @.-- --.@
  /(.) (.)\
  \ ) . ( /
  '(  v  )`
    \ | /
    ( | )   ÄãºÜÐÔ¸Ð
    '- -`
LONG);
return BLINK+HIC"ºÙºÙ...\n"NOR;
}